https://github.com/okovtun/BD_321.git
https://www.youtube.com/watch?v=1OC_9iEGJ24&list=PLeqyOOqxeiIMr5G8nf1P8iQwzzwZIv1vW

https://t.me/+ovxoPDMg4ZA0Yzk6

TOREAD:
https://legacy.cplusplus.com/
https://en.cppreference.com/w/
https://stackoverflow.com/

devenv:
https://www.youtube.com/watch?v=cLBwgKNIlNw

TODO:
В проекте Shift выполнить циклический сдвиг массива на заданное число элементов вправо.

DONE:
1. Выбрать пять проектов, и залить из на GitHub;
2. В проекте 'Arrays' написать код, который:
	-позволяет ввести элементы массива с клавиатуры;
	-выводит массив на экран в прямом порядке (от 0-го элемента до последнего);
	-выводит массив на экран в обратном порядке (от последнего элемента до 0-го);
	-вычисляет сумму элементов массива;
	-вычисляет среднее-арифметическое элементов массива;
	-находит минимальное и максимальное значение в массиве;

DONE:
1. Добить фигуры из прошлой домашки;
2. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg;
3. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg;
4.*** Вывести на экран треугольник Паскаля;

DONE:
Вывести в консоль все фигуры из файла:
	https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt
Размер фигуры пользоватль вводит с клавиатуры.

DONE:
1. Выровнять таблицу умножения таким образом, чтобы младший разряд всегда	DONE
   находился под младшим разрядом - единицы над единицами, десятки над десятками, и т.д.
2. Вывести на экран таблицу Пифагора;					DONE
3. Вывести на экран ряд Фибоначчи до заданного предела;
4. Вывести на экран заданное количество чисел из ряда Фибоначчи;
	Ряд Фибоначчи - это ряд чисел, каждый следующий член которого == сумме двух предыдущих членов ряда.
		0	1	1	2	3	5	8	.......
5. Вывести на экран ряд простых чисел до указанного предела.
	Простым называется число, которое делится без остатка только на себя и на единицу,
	этому требованию удовлетворяют и ссотавные числа, но они делятся без остатка и на другие чила.


DONE:
1. Написать программу, которая вычисляет факториал числа, введенного с клавиатуры.
   Факториал - это произведение ряда чисел от 1 до указанного, например:
	5! = 1*2*3*4*5 = 120;
2. Написать программу, которая возводит указанное число в указанную степень,
   основание и показатель стпени вводятся с клавиатуры;
3. Вывести на экран ASCII-таблицу по 16 символов в строке;

DONE:
1. Пользователь вводит номер автобусного билета, а программа говорит, является ли этот билет счастливым, или нет.
   Счастливым называется билет, у которого сумма трех старших разрядов равна сумме трех младших разрядов, например
	123123 - Счастливый билет
	434731 - Счастливый билет
	123777 - Обычный билет
2. В Solution 'Control structures' добавить проект 'Shooter' и в нем реализовать следующую игру:
	Пользоавтель нажимает на определенные клавиши, а программа выводит на экран определенные действия:
		w - вперед
		s - назад
		a - влево
		d - вправо
		space - прыжок
		enter - огонь
	Если пользователь нажал на какую-то другую клавишу, программа выводит 'Error'
	Выход из программы осуществляется клавишей Escape.

DONE:
1. Выучить теорию!!!
2. В проекте Calc написать такой же калькулятор, только с использованием конструкции switch;					DONE
3. Пользователь вводит число с клавиатуры, а программа должна сказать, является ли данное число палиндромом.	DONE
   Палиндром - это число, которое читается одинаково в обоих направлениях, например
   121
   1221
   12321

DONE:
1. Выучить теорию!!!
2. Поменять местами две переменные:
	int a = 2, b = 3;
	cout << a << "\t" << b << endl;
	.....
	.....
	.....
	cout << a << "\t" << b << endl;

DONE:
1. Выучить теорию!!!
2. Решить все задачи из файла:
	https://github.com/okovtun/BD_321/blob/master/DataTypes/VariablesTask.pdf
3. Почитать: https://legacy.cplusplus.com/doc/tutorial/constants/
DONE:
1. Выучить теорию!!!
2. Используя оператор sizeof() и макросы Visual Studio вывести в консоль информацию 
   о всех изученных числовых типах.

DONE:
1. Выучить теорию!!!
2. Вывести в консоль стишок "В лесу родилась Ёлочка". Стишок должен быть выровнен по середине окна консоли,
   и его куплеты должны быть разделены пустой строкой.