#include<iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "rus");
	int n;

	cout << "Введите количество строк: ";
	cin >> n;

	for (int i = 0; i < n; i++)
	{
		int coef = 1;
		// добавляем пробелы перед строкой
		for (int j = 1; j <= n - i; j++)
		{
			cout.width(4);
			cout << "  ";
		}
		// выводим значения в строке
		for (int j = 0; j <= i; j++)
		{
			cout.width(8);
			cout << coef /*<< "  "*/;
			coef = coef * (i - j) / (j + 1);
		}
		cout << endl;
	}

	// Этот код позволяет вывести на экран треугольник Паскаля для заданного n.
	// Для каждой строки треугольника (i - ой строки, начиная с 0)
	// вычисляются i + 1 коэффициентов с помощью формулы сочетания : coef = coef * (i - j) / (j + 1). 
	// Первый цикл выводит пробелы для отступа, чтобы треугольник был выровнен по центру.
	// Второй цикл выводит коэффициенты i - ой строки.
	// Использование переменной coef для хранения текущего коэффициента позволяет вычислять следующий коэффициент через предыдущий.
	// Переход на следующую строку происходит с помощью команды endl.
}